// ЗАДАЧА 1
// НАПИШІТЬ РЕЧЕННЯ ЗА ДОПОМОГОЮ ШАБЛОННОГО РЯДКА "ДОБРОГО ДНЯ,МЕНЕ ЗВАТИ ГАЛИНА, МЕНІ 35 РОКІВ, Я ВИВЧАЮ JAVASCRIPT"
/*
const name = "ГАЛИНА";
const age = 35;
const hobby = "JAVASCRIPT";
const total = `ДОБРОГО ДНЯ,МЕНЕ ЗВАТИ ${name}, МЕНІ ${age} РОКІВ, Я ВИВЧАЮ ${hobby}`;
console.log(total);*/

/*ЗАДАЧА 2
ЗАПИТАТИ У КОРИСТУВАЧА ІМЯ, ПОЧТУ , ТЕЛЕФОН, І ПОКАЗАТИ У КОНСОЛІ "КОРИСТУВАЧ __ ВИКОРИСТОВУЄ  __ ПОЧТУ І __ ТЕЛЕФОН"*/
// const name = prompt("введіть ім'я");
// const email = prompt("ваша пошта");
// const phone = prompt("ваш телефон");
// const message = `КОРИСТУВАЧ ${name} ВИКОРИСТОВУЄ  ${email} ПОЧТУ І ${phone} ТЕЛЕФОН`
// alert(message);

// ЗАДАЧА 3
// ПОТРІБНО ЗАПИТАТИ У МАГАЗИНІ ЦІНУ ЗА КОЖЕН ОКРЕМИЙ ТОВАР,ТА ВИВЕСТИ ПОВІДОМЛЕННЯМ   ЗАГАЛЬНУ ЦІНУ ТОВАРУ
// const price1 = Number(prompt("Введіть ціну комп'ютера"));
// const price2 = Number(prompt("Введіть ціну телевізора"));
// const price3 = +prompt("Введіть ціну телефона");

// alert(`Загальна ціна товарів: ${price1+price2+price3}`);

// ЗАДАЧА 4
// ВИКОРИСТОВУЮЧИ КОНСТРУКЦІЮ IF...ELSE , НАПИШИ КОД, ЯКИЙ БУДЕ ЗАПИТУВАТИ:
// "СКІЛЬКИ МІСЯЦІВ МАЄ РІК", ЯКЩО КОРИСТУВАЧ ВВОДИТЬ 12 ТО У КОНСОЛІ ПИШЕ ВІРНО, ЯКЩО НЕ ПРАВИЛЬНО КОРИСТУВАЧ ВВІВ, ТОДІ У КОНСОЛІ ПИШЕ
// "НЕ ЗНАЄТЕ? 12"

// const page = Number(prompt("СКІЛЬКИ МІСЯЦІВ МАЄ РІК"));

// if (page === 12) {
//   alert("Вірно");
// } else {
//   alert("НЕ ВІРНО");
// }

// ЗАДАЧА 5
// НАПИШІТЬ ПРОГРАМУ, ЯКА ДОЗВОЛЯТИМЕ ЮЗЕРУ ВВОДИТИ ЧИСЛО І ВИЗНАЧАТИМЕ ЧИ ЦЕ ПАРНЕ ЧИСЛО, ЧИ НЕ ПАРНЕ.

// const user = Number(prompt("Введіть число"));
// if (user % 2 === 0) {
//   alert("Парне");
// } else {
//   alert("Не парне");
// }

// ЗАДАЧА 10
// НАПИШІТЬ ПРОГРАМУ, ЯКА БУДЕ ВИЗНАЧАТИ ДОВЖИНУ ІМЕНІ , ЯКЩО ІМЯ БІЛЬШЕ 7 СИМВОЛІВ, КОНСОЛЬ ВИВОДИТЬ "Wow, you  have a REALLY long name!" , ЯКЩО МЕНШЕ 7
// "Your name isn't very long"

// const userName = prompt("Введіть своє імя");
// if (userName.length > 7) {
//   alert("Wow, you  have a REALLY long name!");
// } else {
//   alert("Your name isn't very long");
// }

// ЗАДАЧА 7
// НАПИШІТЬ ПРОГРАМУ, ЯКА ПРОВІРЯЄ ЛОГІН І ПАРОЛЬ, І ВИВОДИТЬ ПРИВІТАННЯ - ЯКЩО ВСЕ ДОБРЕ, АБО ВИДАЄ ПОМИЛКУ , ЩО НЕ ВІРНИЙ ЛОГІН

// const password = "sasasasasas";
// const login = "maksym";

// const newPassword = prompt("password");
// const newLogin = prompt("login");

// if (password === newPassword && login === newLogin) {
//   alert("Все вірно");
// } else {
//   alert("Помилка");
// }

// --------------------------------------------------- НА ОПРАЦЮВАННЯ ---------------------------------------------------

// ЗАДАЧА 6
// НАПИШІТЬ ПРОГРАМУ, ДЕ МИ У КОРИСТОВАЧА ПИТАЄМОСЬ МІСЯЦЬ НАРОДЖЕННЯ, І ПОКАЗУЄМО У ЯКУ ПОРУ РОКУ ВІН НАРОДИВСЯ

// const userMonth = Number(prompt("Введіть місяць народження(цифру): "));

// // Розв'язок Максима Ярошенка

// if (userMonth === 12 || (userMonth >= 1 && userMonth <= 2)) {
//   alert("Ви народилися взимку");
// } else if (userMonth >= 3 && userMonth <= 5) {
//   alert("Ви народилися весною");
// } else if (userMonth >= 6 && userMonth <= 8) {
//   alert("Ви народилися літом");
// } else if (userMonth >= 9 && userMonth <= 11) {
//   alert("Ви народилися восени");
// } else {
//   alert("Ви ввели щось не так");
// }

// ЗАДАЧА 8
// НАПИШІТЬ ПРОГРАМУ , ЯКА БУДЕ ЗАПИТУВАТИ У КОРИСТУВАЧА ПЕРІОД ПІДПИСКИ НА СЕРВІС ТА ПОКАЗУВАТИМЕ ЦІНУ ПІДПИСКИ(ВИКОРИСТАЙ IF..ELSE, ТА ПЕРЕПИШИ НА SWITCH)
// ЯКЩО ДЕНЬ - ціна 1.99
// ЯУЩО НЕДІЛЯ - ціна 5.99
// ЯКЩО МІСЯЦЬ - ціна 10.99
// ЯКЩО РІК - ціна 100.99

// const userSubscription = prompt(
//   "ПЕРІОД ПІДПИСКИ НА СЕРВІС(ДЕНЬ, НЕДІЛЯ, МІСЯЦЬ, РІК):"
// ).toUpperCase();

// // Розв'язок Максима Ярошенка

// switch (userSubscription) {
//   case "ДЕНЬ":
//     alert("ціна 1.99");
//     break;
//   case "НЕДІЛЯ":
//     alert("ціна 5.99");
//     break;
//   case "МІСЯЦЬ":
//     alert("ціна 10.99");
//     break;
//   case "РІК":
//     alert("ціна 100.99");
//     break;
//   default:
//     alert("Ви ввели щось не так");
//     break;
// }

// ЗАДАЧА 9
// НАПИШІТЬ ЦИКЛ FOR ЯКА БУДЕ ВИВОДИТИ У КОНСОЛЬ ЧИСЛА ЗА ЗРОСТАННЯМ ВІД MIN ДО MAX, ПІСЛЯ ТОГО ЧИСЛА КРАТНІ 10

// // Розв'язок Максима Ярошенка

// function multiplesOfTen(min, max) {
//   for (min; min <= max; min++) {
//     if (min % 10 === 0) {
//       console.log(min);
//     }
//   }
// }

// multiplesOfTen(9, 100);

// ЗАДАЧА 13
// При помощи цикла for додайте все четные числа от   min до max

// // Розв'язок Максима Ярошенка

// function sumOfEvenNumbers(min, max) {
//   let total = 0;
//   for (min; min <= max; min++) {
//     if (min % 2 === 0) {
//       total += min;
//     }
//   }
//   return total;
// }

// console.log(sumOfEvenNumbers(1, 15));
