// ЗАДАЧА 1
// НАПИШІТЬ РЕЧЕННЯ ЗА ДОПОМОГОЮ ШАБЛОННОГО РЯДКА "ДОБРОГО ДНЯ,МЕНЕ ЗВАТИ ГАЛИНА, МЕНІ 35 РОКІВ, Я ВИВЧАЮ JAVASCRIPT"
/*
const name = "ГАЛИНА";
const age = 35;
const hobby = "JAVASCRIPT";
const total = `ДОБРОГО ДНЯ,МЕНЕ ЗВАТИ ${name}, МЕНІ ${age} РОКІВ, Я ВИВЧАЮ ${hobby}`;
console.log(total);*/

/*ЗАДАЧА 2
ЗАПИТАТИ У КОРИСТУВАЧА ІМЯ, ПОЧТУ , ТЕЛЕФОН, І ПОКАЗАТИ У КОНСОЛІ "КОРИСТУВАЧ __ ВИКОРИСТОВУЄ  __ ПОЧТУ І __ ТЕЛЕФОН"*/
// const name = prompt("введіть ім'я");
// const email = prompt("ваша пошта");
// const phone = prompt("ваш телефон");
// const message = `КОРИСТУВАЧ ${name} ВИКОРИСТОВУЄ  ${email} ПОЧТУ І ${phone} ТЕЛЕФОН`
// alert(message);

// ЗАДАЧА 3
// ПОТРІБНО ЗАПИТАТИ У МАГАЗИНІ ЦІНУ ЗА КОЖЕН ОКРЕМИЙ ТОВАР,ТА ВИВЕСТИ ПОВІДОМЛЕННЯМ   ЗАГАЛЬНУ ЦІНУ ТОВАРУ
// const price1 = Number(prompt("Введіть ціну комп'ютера"));
// const price2 = Number(prompt("Введіть ціну телевізора"));
// const price3 = +prompt("Введіть ціну телефона");

// alert(`Загальна ціна товарів: ${price1+price2+price3}`);

// ЗАДАЧА 4
// ВИКОРИСТОВУЮЧИ КОНСТРУКЦІЮ IF...ELSE , НАПИШИ КОД, ЯКИЙ БУДЕ ЗАПИТУВАТИ:
// "СКІЛЬКИ МІСЯЦІВ МАЄ РІК", ЯКЩО КОРИСТУВАЧ ВВОДИТЬ 12 ТО У КОНСОЛІ ПИШЕ ВІРНО, ЯКЩО НЕ ПРАВИЛЬНО КОРИСТУВАЧ ВВІВ, ТОДІ У КОНСОЛІ ПИШЕ
// "НЕ ЗНАЄТЕ? 12"

// const page = Number(prompt("СКІЛЬКИ МІСЯЦІВ МАЄ РІК"));

// if (page === 12) {
//   alert("Вірно");
// } else {
//   alert("НЕ ВІРНО");
// }

// ЗАДАЧА 5
// НАПИШІТЬ ПРОГРАМУ, ЯКА ДОЗВОЛЯТИМЕ ЮЗЕРУ ВВОДИТИ ЧИСЛО І ВИЗНАЧАТИМЕ ЧИ ЦЕ ПАРНЕ ЧИСЛО, ЧИ НЕ ПАРНЕ.

const user = Number(prompt("Введіть число"));
if (user % 2 === 0) {
  alert("Парне");
} else {
  alert("Не парне");
}
